app/Controllers/Home.php

SELECT `a`.`plate_number`, `b`.`Name`, `c`.`Name` as `model`
FROM `tblrecords_merchant` `a`
INNER JOIN `tblvehicles` `b` ON `b`.`vID`=`a`.`vID`
INNER JOIN `tblvehicle_model` `c` ON `c`.`mID`=`a`.`mID`
WHERE `a`.`BookingNumber` = 'IA-0000868-10'
---
    public function Payment($id = null)
    {
        $userModel = new \App\Models\merchantModel();
        $loggedUserID = session()->get('loggedUser');
        $userInfo = $userModel->find($loggedUserID);
        //get all the records once confirmed
        $passengerModel = new \App\Models\passengerModel();
        $query = $passengerModel->WHERE('BookingNumber',$id)->findAll();
        //get the total amount
        $paymentModel = new \App\Models\paymentModel();
        $payment = $paymentModel->WHERE('BookingNumber',$id)->findAll();
        //cargo model
        $builder = $this->db->table('tblrecords_merchant a');
        $builder->select('a.plate_number,b.Name,c.Name as model');
        $builder->join('tblvehicles b','b.vID=a.vID','INNER');
        $builder->join('tblvehicle_model c','c.mID=a.mID','INNER');
        $builder->WHERE('a.BookingNumber',$id);
        $vehicle = $builder->get()->getResult();

SELECT `vesselID`
FROM `tblschedule`
WHERE `ID` = '230'
---
    public function availableSeats()
    {
        $val = $this->request->getGet('value');
        $date = $this->request->getGet('date');
        $vessel=0;$business;$premium;$econo;$premium_without_ac;$business_without_ac;
        //get the vessel
        $builder = $this->db->table('tblschedule');
        $builder->select('vesselID');
        $builder->WHERE('ID',$val);
        $data = $builder->get();

SELECT `TimeDeparture`, `TimeArrival`
FROM `tblschedule`
WHERE `ID` = '231'
---
    public function Departure()
    {
        $val = $this->request->getGet('value');
        $builder = $this->db->table('tblschedule');
        $builder->select('TimeDeparture,TimeArrival');
        $builder->WHERE('ID',$val);
        $data = $builder->get();

SELECT `portID`
FROM `tblschedule`
WHERE `ID` = '231'
SELECT FORMAT(Amount, 2)Amount
FROM `tblprice`
WHERE `Seat_Type` = 'Economy'
AND `portID` = '10'
---
    public function fetchRate()
    {
        $seat = $this->request->getGet('accommodation');
        $id = $this->request->getGet('schedule');
        $port;
        $builder = $this->db->table('tblschedule');
        $builder->select('portID');
        $builder->WHERE('ID',$id);
        $data = $builder->get();
        if($row = $data->getRow())
        {
            $port = $row->portID;
        }
        //get the price
        $builder = $this->db->table('tblprice');
        $builder->select('FORMAT(Amount,2)Amount');
        $builder->WHERE('Seat_Type',$seat);
        $builder->WHERE('portID',$port);
        $data = $builder->get();