app/Controllers/PassengerController.php

SELECT `b`.`Vehicle_Class`
FROM `tblrecords_merchant` `a`
LEFT JOIN `tblclasses` `b` ON `b`.`vID`=`a`.`vID`
WHERE `a`.`ID` = '230'
AND `a`.`agentID` = '117'
AND `b`.`Vehicle_Class` IN ('Type 3','Type 4')
AND `a`.`TrxnDate` = '2024-03-27'
AND `a`.`BookingNumber` = ''
---
    public function Verification()
    {
        $user = $this->request->getGet('user');
        $id = $this->request->getGet('schedule');
        $date = $this->request->getGet('date');
        //get the vID
        $class_type = ['Type 3','Type 4'];
        $builder = $this->db->table('tblrecords_merchant a');
        $builder->select("b.Vehicle_Class");
        $builder->join("tblclasses b","b.vID=a.vID","LEFT");
        $builder->WHERE("a.ID",$id)->WHERE("a.agentID",$user)->WHEREIN('b.Vehicle_Class',$class_type);
        $builder->WHERE("a.TrxnDate",$date)->WHERE("a.BookingNumber","");
        $data = $builder->get();

SELECT IFNULL(SUM(Amount), 0)total
FROM `tblrecords_merchant`
WHERE `customerID` = '113'
AND `BookingNumber` = 'IA-0000868-10'
SELECT IFNULL(SUM(Rate), 0)rate
FROM `tblcargo_merchant`
WHERE `userID` = '113'
AND `BookingNumber` = 'IA-0000868-10'
---
    public function paymentBreakdown()
    {
        $code = $this->request->getGet('code');
        $user = $this->request->getGet('user');
        $builder = $this->db->table('tblrecords_merchant');
        $builder->select('IFNULL(SUM(Amount),0)total');
        $builder->WHERE('customerID',$user)->WHERE('BookingNumber',$code);
        $data = $builder->get();
        if($row = $data->getRow())
        {
            ?>
            <tr>
                <td>Base Fare</td><td style="text-align:right;"><?php echo number_format($row->total,2) ?></td>
            </tr>
            <?php
        }
        //cargo
        $builder = $this->db->table('tblcargo_merchant');
        $builder->select('IFNULL(SUM(Rate),0)rate');
        $builder->WHERE('userID',$user)->WHERE('BookingNumber',$code);
        $cargos = $builder->get();

SELECT IFNULL(SUM(Amount), 0)total
FROM `tblrecords_merchant`
WHERE `customerID` = '113'
AND `BookingNumber` = ''
AND `Status` = 0
AND `ID` = '230'
---
    public function Confirmation()
    {
        //database
        $savePassenger = new \App\Models\passengerModel();
        $adminFee = new \App\Models\convenienceModel();
        $cargoModel = new \App\Models\cargoModel();
        $paymentModel = new \App\Models\paymentModel();
        //variables
        $user = $this->request->getPost('user');
        $id = $this->request->getPost('schedule');
        $date = $this->request->getPost('date');
        $port = $this->request->getPost('port');
        $agent = $this->request->getPost('agent');
        $code= "";
        //generate booking number
        $builder = $this->db->table('tblcustomer_payment_merchant');
        $builder->select('COUNT(*)+1 as total');
        $data = $builder->get();
        if($row = $data->getRow())
        {
            $code = "IA-".str_pad($row->total, 7, '0', STR_PAD_LEFT)."-".$port;
        }
        //compute the total
        $net;$total;$price;
        $builder = $this->db->table('tblrecords_merchant');
        $builder->select('IFNULL(SUM(Amount),0)total');
        $builder->WHERE('customerID',$user)->WHERE('BookingNumber','');
        $builder->WHERE('Status',0)->WHERE('ID',$id)->WHERE('TrxnDate',$date);
        $data = $builder->get();

SELECT IFNULL(SUM(Amount), 0)total
FROM `tblrecords_merchant`
WHERE `customerID` = '113'
AND `BookingNumber` = ''
AND `TrxnDate` = '2024-03-27'
AND `Status` = 0
AND `ID` = '230'
SELECT IFNULL(SUM(NetAmount), 0)price
FROM `tblcargo_merchant`
WHERE `userID` = '113'
AND `BookingNumber` = ''
AND `ID` = '230'
SELECT SUM(Amount)admin_fee
FROM `tblconvenience_merchant`
WHERE `userID` = '113'
AND `BookingNumber` = ''
AND `Date` = '2024-03-27'
---
    public function Summary()
    {
        $user = $this->request->getGet('user');
        $id = $this->request->getGet('schedule');
        $date = $this->request->getGet('date');
        $total=0;$cargo = 0;$admin = 0;
        $builder = $this->db->table('tblrecords_merchant');
        $builder->select('IFNULL(SUM(Amount),0)total');
        $builder->WHERE('customerID',$user)->WHERE('BookingNumber',"")->WHERE('TrxnDate',$date)->WHERE('Status',0)->WHERE('ID',$id);
        $data = $builder->get();
        if($row = $data->getRow())
        {
            $total = $row->total;
        }
        $builder = $this->db->table('tblcargo_merchant');
        $builder->select('IFNULL(SUM(NetAmount),0)price');
        $builder->WHERE('userID',$user)->WHERE('BookingNumber',"")->WHERE('ID',$id);
        $cargos = $builder->get();
        if($row = $cargos->getRow())
        {
            $cargo = $row->price;
        }
        //get the admin fee
        $admin_fee;
        $builder = $this->db->table('tblconvenience_merchant');
        $builder->select('SUM(Amount)admin_fee');
        $builder->WHERE('userID',$user)->WHERE('BookingNumber',"")->WHERE('Date',$date);
        $data = $builder->get();

SELECT `recordID`, `Fullname`, `Accommodation`, `SeatNumber`, `BirthDate` as `Age`
FROM `tblrecords_merchant`
WHERE `ID` = '230'
AND `customerID` = '113'
AND `TrxnDate` = '2024-03-27'
AND `BookingNumber` = ''
ORDER BY `recordID` DESC
---
    public function Passenger()
    {
        $user = $this->request->getGet('user');
        $id = $this->request->getGet('schedule');
        $date = $this->request->getGet('date');
        $builder = $this->db->table('tblrecords_merchant');
        $builder->select('recordID,Fullname,Accommodation,SeatNumber,BirthDate as Age');
        $builder->WHERE('ID',$id)->WHERE('customerID',$user);
        $builder->WHERE('TrxnDate',$date)->WHERE('BookingNumber','');
        $builder->orderby('recordID','DESC');
        $data = $builder->get();